"""
1. Поработайте с переменными, создайте несколько, выведите на экран,
запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
"""

pervaja = 1                 # создайте несколько переменных
vtoraja = 2
tretja = 3

print(pervaja, vtoraja, tretja)            # выведите на экран

year = input('Введите год рождения: ')
month = input('Введите месяц рождения: ')    # запросите у пользователя несколько чисел и строк и сохраните в переменные
day = input('Введите день рождения: ')
name = input('Введите имя: ')
surname = input('Введите Фамилию: ')
print(f'{year}- года, {month} {day} {name} {surname} - ты чертовски счастливый!!') # выведите на экран.

## OK